In [1]:
import pandas as pd

In [3]:
data = {'Names':['Mary', 'Bob', 'Camila', 'Chris','Antony', 'Mary'],
        'Marks':[56,89,90,45,34,56],
        'City':['Armenia', 'Nepal', 'Belgium', 'Greece', 'Ghana', 'Armenia']}
df = pd.DataFrame(data)
df

    Names  Marks     City
0    Mary     56  Armenia
1     Bob     89    Nepal
2  Camila     90  Belgium
3   Chris     45   Greece
4  Antony     34    Ghana
5    Mary     56  Armenia

In [5]:
df.drop_duplicates(subset='Names', keep='first')

    Names  Marks     City
0    Mary     56  Armenia
1     Bob     89    Nepal
2  Camila     90  Belgium
3   Chris     45   Greece
4  Antony     34    Ghana

In [6]:
df.drop_duplicates(subset='Names', keep='last')

    Names  Marks     City
1     Bob     89    Nepal
2  Camila     90  Belgium
3   Chris     45   Greece
4  Antony     34    Ghana
5    Mary     56  Armenia